; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@loadCounter = global i32 0, align 4
@storeCounter = global i32 0, align 4
@.str = private unnamed_addr constant [16 x i8] c"Store Injector\0A\00", align 1
@.str.1 = private unnamed_addr constant [32 x i8] c"----------Statistics----------\0A\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c" # Load = %d \0A\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c" # STORE = %d \0A\00", align 1
@x_size1 = common global i32 0, align 4, !dbg !0
@y_size1 = common global i32 0, align 4, !dbg !18
@image1 = common global [4096 x [4096 x i8]] zeroinitializer, align 16, !dbg !10
@x_size2 = common global i32 0, align 4, !dbg !20
@y_size2 = common global i32 0, align 4, !dbg !22
@image2 = common global [4096 x [4096 x i8]] zeroinitializer, align 16, !dbg !16
@.str.4 = private unnamed_addr constant [56 x i8] c"\0A-----------------------------------------------------\0A\00", align 1
@.str.1.5 = private unnamed_addr constant [41 x i8] c"Monochromatic image file input routine \0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "x_size1", scope: !2, file: !12, line: 15, type: !8, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !9)
!3 = !DIFile(filename: "sobel/sobel.c", directory: "/home/bernard/Workspace/Project-LLVM/DynamicCount/apps")
!4 = !{}
!5 = !{!6, !7, !8}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !{!10, !16, !0, !18, !20, !22}
!10 = !DIGlobalVariableExpression(var: !11)
!11 = distinct !DIGlobalVariable(name: "image1", scope: !2, file: !12, line: 13, type: !13, isLocal: false, isDefinition: true)
!12 = !DIFile(filename: "sobel/mypgm.h", directory: "/home/bernard/Workspace/Project-LLVM/DynamicCount/apps")
!13 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 134217728, elements: !14)
!14 = !{!15, !15}
!15 = !DISubrange(count: 4096)
!16 = !DIGlobalVariableExpression(var: !17)
!17 = distinct !DIGlobalVariable(name: "image2", scope: !2, file: !12, line: 14, type: !13, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19)
!19 = distinct !DIGlobalVariable(name: "y_size1", scope: !2, file: !12, line: 15, type: !8, isLocal: false, isDefinition: true)
!20 = !DIGlobalVariableExpression(var: !21)
!21 = distinct !DIGlobalVariable(name: "x_size2", scope: !2, file: !12, line: 16, type: !8, isLocal: false, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23)
!23 = distinct !DIGlobalVariable(name: "y_size2", scope: !2, file: !12, line: 16, type: !8, isLocal: false, isDefinition: true)
!24 = !{!"clang version 5.0.0 (tags/RELEASE_500/final)"}
!25 = !{i32 1, !"wchar_size", i32 4}
!26 = !{i32 2, !"Dwarf Version", i32 4}
!27 = !{i32 2, !"Debug Info Version", i32 3}
!28 = distinct !DISubprogram(name: "load_image_data", scope: !12, file: !12, line: 24, type: !29, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !4)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!34 = !DILocalVariable(name: "file_name", arg: 1, scope: !28, file: !12, line: 24, type: !31)
!35 = !DIExpression()
!36 = !DILocation(line: 24, column: 34, scope: !28)
!37 = !DILocalVariable(name: "buffer", scope: !28, file: !12, line: 28, type: !38)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 256)
!41 = !DILocation(line: 28, column: 8, scope: !28)
!42 = !DILocalVariable(name: "fp", scope: !28, file: !12, line: 29, type: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !45, line: 48, baseType: !46)
!45 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/bernard/Workspace/Project-LLVM/DynamicCount/apps")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 241, size: 1728, elements: !48)
!47 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/bernard/Workspace/Project-LLVM/DynamicCount/apps")
!48 = !{!49, !50, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !70, !71, !72, !73, !77, !79, !81, !85, !88, !90, !91, !92, !93, !94, !98, !99}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 242, baseType: !8, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 247, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 248, baseType: !51, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 249, baseType: !51, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 250, baseType: !51, size: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 251, baseType: !51, size: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 252, baseType: !51, size: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 253, baseType: !51, size: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 254, baseType: !51, size: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 256, baseType: !51, size: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 257, baseType: !51, size: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 258, baseType: !51, size: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 260, baseType: !63, size: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 156, size: 192, elements: !65)
!65 = !{!66, !67, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !64, file: !47, line: 157, baseType: !63, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !64, file: !47, line: 158, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !64, file: !47, line: 162, baseType: !8, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 262, baseType: !68, size: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 264, baseType: !8, size: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 268, baseType: !8, size: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 270, baseType: !74, size: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !75, line: 131, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/bernard/Workspace/Project-LLVM/DynamicCount/apps")
!76 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 274, baseType: !78, size: 16, offset: 1024)
!78 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 275, baseType: !80, size: 8, offset: 1040)
!80 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 276, baseType: !82, size: 8, offset: 1048)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 1)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 280, baseType: !86, size: 64, offset: 1088)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 150, baseType: null)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 289, baseType: !89, size: 64, offset: 1152)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !75, line: 132, baseType: !76)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !46, file: !47, line: 297, baseType: !6, size: 64, offset: 1216)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !46, file: !47, line: 298, baseType: !6, size: 64, offset: 1280)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !46, file: !47, line: 299, baseType: !6, size: 64, offset: 1344)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !46, file: !47, line: 300, baseType: !6, size: 64, offset: 1408)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 302, baseType: !95, size: 64, offset: 1472)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !96, line: 62, baseType: !97)
!96 = !DIFile(filename: "/usr/local/lib/clang/5.0.0/include/stddef.h", directory: "/home/bernard/Workspace/Project-LLVM/DynamicCount/apps")
!97 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 303, baseType: !8, size: 32, offset: 1536)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 305, baseType: !100, size: 160, offset: 1568)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 20)
!103 = !DILocation(line: 29, column: 9, scope: !28)
!104 = !DILocalVariable(name: "max_gray", scope: !28, file: !12, line: 30, type: !8)
!105 = !DILocation(line: 30, column: 7, scope: !28)
!106 = !DILocalVariable(name: "x", scope: !28, file: !12, line: 31, type: !8)
!107 = !DILocation(line: 31, column: 7, scope: !28)
!108 = !DILocalVariable(name: "y", scope: !28, file: !12, line: 31, type: !8)
!109 = !DILocation(line: 31, column: 10, scope: !28)
!110 = !DILocation(line: 34, column: 3, scope: !28)
!111 = !DILocation(line: 35, column: 3, scope: !28)
!112 = !DILocation(line: 36, column: 3, scope: !28)
!113 = !DILocation(line: 37, column: 3, scope: !28)
!114 = !DILocation(line: 38, column: 14, scope: !28)
!115 = !DILocation(line: 38, column: 8, scope: !28)
!116 = !DILocation(line: 38, column: 6, scope: !28)
!117 = !DILocation(line: 39, column: 15, scope: !118)
!118 = distinct !DILexicalBlock(scope: !28, file: !12, line: 39, column: 7)
!119 = !DILocation(line: 39, column: 12, scope: !118)
!120 = !DILocation(line: 39, column: 7, scope: !28)
!121 = !DILocation(line: 40, column: 5, scope: !122)
!122 = distinct !DILexicalBlock(scope: !118, file: !12, line: 39, column: 19)
!123 = !DILocation(line: 41, column: 5, scope: !122)
!124 = !DILocation(line: 44, column: 9, scope: !28)
!125 = !DILocation(line: 44, column: 33, scope: !28)
!126 = !DILocation(line: 44, column: 3, scope: !28)
!127 = !DILocation(line: 45, column: 7, scope: !128)
!128 = distinct !DILexicalBlock(scope: !28, file: !12, line: 45, column: 7)
!129 = !DILocation(line: 45, column: 17, scope: !128)
!130 = !DILocation(line: 45, column: 24, scope: !128)
!131 = !DILocation(line: 45, column: 27, scope: !128)
!132 = !DILocation(line: 45, column: 37, scope: !128)
!133 = !DILocation(line: 45, column: 7, scope: !28)
!134 = !DILocation(line: 46, column: 5, scope: !135)
!135 = distinct !DILexicalBlock(scope: !128, file: !12, line: 45, column: 45)
!136 = !DILocation(line: 47, column: 5, scope: !135)
!137 = !DILocation(line: 50, column: 11, scope: !28)
!138 = !DILocation(line: 51, column: 11, scope: !28)
!139 = !DILocation(line: 52, column: 3, scope: !28)
!140 = !DILocation(line: 52, column: 10, scope: !28)
!141 = !DILocation(line: 52, column: 18, scope: !28)
!142 = !DILocation(line: 52, column: 23, scope: !28)
!143 = !DILocation(line: 52, column: 26, scope: !28)
!144 = !DILocation(line: 52, column: 34, scope: !28)
!145 = !DILocation(line: 53, column: 11, scope: !146)
!146 = distinct !DILexicalBlock(scope: !28, file: !12, line: 52, column: 40)
!147 = !DILocation(line: 53, column: 35, scope: !146)
!148 = !DILocation(line: 53, column: 5, scope: !146)
!149 = !DILocation(line: 54, column: 9, scope: !150)
!150 = distinct !DILexicalBlock(scope: !146, file: !12, line: 54, column: 9)
!151 = !DILocation(line: 54, column: 19, scope: !150)
!152 = !DILocation(line: 54, column: 9, scope: !146)
!153 = !DILocation(line: 55, column: 14, scope: !154)
!154 = distinct !DILexicalBlock(scope: !150, file: !12, line: 54, column: 27)
!155 = !DILocation(line: 55, column: 7, scope: !154)
!156 = !DILocation(line: 56, column: 5, scope: !154)
!157 = distinct !{!157, !139, !158}
!158 = !DILocation(line: 57, column: 3, scope: !28)
!159 = !DILocation(line: 59, column: 12, scope: !28)
!160 = !DILocation(line: 60, column: 3, scope: !28)
!161 = !DILocation(line: 60, column: 10, scope: !28)
!162 = !DILocation(line: 60, column: 19, scope: !28)
!163 = !DILocation(line: 61, column: 11, scope: !164)
!164 = distinct !DILexicalBlock(scope: !28, file: !12, line: 60, column: 25)
!165 = !DILocation(line: 61, column: 35, scope: !164)
!166 = !DILocation(line: 61, column: 5, scope: !164)
!167 = !DILocation(line: 62, column: 9, scope: !168)
